#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
random_id.bucket_id: Refreshing state... [id=1NQhVYR7gkQ]
data.google_client_config.provider: Reading...
module.stg_apps.google_compute_global_address.static_ip: Refreshing state... [id=projects/hackathon-climat-05/global/addresses/greenmile-front-stg]
google_storage_bucket.tf_state_bucket: Refreshing state... [id=terraform-state-d4d42155847b8244]
module.prod_apps.google_compute_global_address.static_ip: Refreshing state... [id=projects/hackathon-climat-05/global/addresses/greenmile-front-prod]
google_container_cluster.prod_cluster: Refreshing state... [id=projects/hackathon-climat-05/locations/europe-west1/clusters/prod-cluster]
data.google_client_config.provider: Read complete after 0s [id=projects/hackathon-climat-05/regions//zones/]
module.stg_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-stg]
module.prod_apps.kubernetes_namespace.namespace: Refreshing state... [id=greenmile-prod]
module.prod_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-prod/app-front]
module.stg_apps.kubernetes_deployment.app_front: Refreshing state... [id=greenmile-stg/app-front]
module.prod_apps.kubernetes_service.front: Refreshing state... [id=greenmile-prod/front]
module.stg_apps.kubernetes_service.front: Refreshing state... [id=greenmile-stg/front]
module.stg_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-stg/front-autoscaler]
module.prod_apps.kubernetes_horizontal_pod_autoscaler.front_autoscaler: Refreshing state... [id=greenmile-prod/front-autoscaler]
module.prod_apps.module.calculator_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-prod/calculator-microservice]
module.prod_apps.module.challenges_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-prod/challenges-microservice]
module.prod_apps.module.data_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-prod/data-microservice]
module.prod_apps.module.auth_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-prod/auth-microservice]
module.stg_apps.kubernetes_manifest.app_ssl_certificate: Refreshing state...
module.prod_apps.kubernetes_manifest.app_ssl_certificate: Refreshing state...
module.prod_apps.module.data_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-prod/data]
module.prod_apps.module.data_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-prod/data-autoscaler]
module.prod_apps.module.challenges_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-prod/challenges]
module.prod_apps.module.challenges_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-prod/challenges-autoscaler]
module.prod_apps.module.auth_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-prod/auth-autoscaler]
module.prod_apps.module.auth_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-prod/auth]
module.prod_apps.module.calculator_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-prod/calculator]
module.prod_apps.module.calculator_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-prod/calculator-autoscaler]
module.stg_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-stg/app-ingress]
module.prod_apps.kubernetes_ingress_v1.app_ingress: Refreshing state... [id=greenmile-prod/app-ingress]
module.stg_apps.module.auth_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-stg/auth-microservice]
module.stg_apps.module.challenges_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-stg/challenges-microservice]
module.stg_apps.module.data_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-stg/data-microservice]
module.stg_apps.module.calculator_microservice.kubernetes_deployment.microservice: Refreshing state... [id=greenmile-stg/calculator-microservice]
module.stg_apps.module.auth_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-stg/auth-autoscaler]
module.stg_apps.module.calculator_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-stg/calculator]
module.stg_apps.module.auth_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-stg/auth]
module.stg_apps.module.calculator_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-stg/calculator-autoscaler]
module.stg_apps.module.data_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-stg/data]
module.stg_apps.module.data_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-stg/data-autoscaler]
module.stg_apps.module.challenges_microservice.kubernetes_horizontal_pod_autoscaler.autoscaler: Refreshing state... [id=greenmile-stg/challenges-autoscaler]
module.stg_apps.module.challenges_microservice.kubernetes_service.service: Refreshing state... [id=greenmile-stg/challenges]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.prod_apps.helm_release.mariadb will be created
  + resource "helm_release" "mariadb" {
      + atomic                     = false
      + chart                      = "mariadb-galera"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mariadb"
      + namespace                  = "greenmile-prod"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + <<-EOT
                "db":
                  "forcePassword": true
                  "name": "greenmile"
                  "user": "greenmile"
                "galera":
                  "mariabackup":
                    "forcePassword": true
                    "user": "mariabackup"
                "rootUser":
                  "forcePassword": true
            EOT,
        ]
      + verify                     = false
      + version                    = "7.3.5"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.prod_apps.kubernetes_secret.mariadb_credentials will be created
  + resource "kubernetes_secret" "mariadb_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "mariadb-credentials"
          + namespace        = "greenmile-prod"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.prod_apps.random_password.mariadb_backup_password will be created
  + resource "random_password" "mariadb_backup_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.prod_apps.random_password.mariadb_root_password will be created
  + resource "random_password" "mariadb_root_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.prod_apps.random_password.mariadb_user_password will be created
  + resource "random_password" "mariadb_user_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.stg_apps.helm_release.mariadb will be created
  + resource "helm_release" "mariadb" {
      + atomic                     = false
      + chart                      = "mariadb-galera"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "mariadb"
      + namespace                  = "greenmile-stg"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + values                     = [
          + <<-EOT
                "db":
                  "forcePassword": true
                  "name": "greenmile"
                  "user": "greenmile"
                "galera":
                  "mariabackup":
                    "forcePassword": true
                    "user": "mariabackup"
                "rootUser":
                  "forcePassword": true
            EOT,
        ]
      + verify                     = false
      + version                    = "7.3.5"
      + wait                       = true
      + wait_for_jobs              = false

      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.stg_apps.kubernetes_secret.mariadb_credentials will be created
  + resource "kubernetes_secret" "mariadb_credentials" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "mariadb-credentials"
          + namespace        = "greenmile-stg"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.stg_apps.random_password.mariadb_backup_password will be created
  + resource "random_password" "mariadb_backup_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.stg_apps.random_password.mariadb_root_password will be created
  + resource "random_password" "mariadb_root_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.stg_apps.random_password.mariadb_user_password will be created
  + resource "random_password" "mariadb_user_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.prod_apps.module.auth_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-prod/auth-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.prod_apps.module.calculator_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-prod/calculator-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "calculator-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.prod_apps.module.challenges_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-prod/challenges-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "challenges-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.prod_apps.module.data_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-prod/data-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "data-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.module.auth_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-stg/auth-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "auth-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.module.calculator_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-stg/calculator-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "calculator-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.module.challenges_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-stg/challenges-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "challenges-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.stg_apps.module.data_microservice.kubernetes_deployment.microservice will be updated in-place
  ~ resource "kubernetes_deployment" "microservice" {
        id               = "greenmile-stg/data-microservice"
        # (1 unchanged attribute hidden)


      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                        name                       = "data-microservice"
                        # (9 unchanged attributes hidden)

                      + env {
                          + name = "DB_HOST"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "host"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PORT"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "port"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_USER"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "user"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_PASSWORD"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "password"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }
                      + env {
                          + name = "DB_DATABASE"

                          + value_from {

                              + secret_key_ref {
                                  + key  = "database"
                                  + name = "mariadb-credentials"
                                }
                            }
                        }




                        # (4 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
                # (1 unchanged block hidden)
            }
            # (2 unchanged blocks hidden)
        }
        # (1 unchanged block hidden)
    }

Plan: 10 to add, 8 to change, 0 to destroy.

Changes to Outputs:
  - mariadb_backup_password = (sensitive value)
  - mariadb_root_password   = (sensitive value)
  - mariadb_user_password   = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @au2001, Action: `pull_request`*